newwms_gift/src/Reports/ит_WMS_МотивационныйОтчет/ит_WMS_МотивационныйОтчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ит_WMS_МотивационныйОтчет</name>
  <attributes>
    <name>СтоимостьКороба</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьКоробаПМУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьСпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПодъема</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПеремещения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПеремещенияПМУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПаллетыНаборки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АгрегацияПаллеты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФизическаяПроверка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АгрегацияКоробов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Опалечивание</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЗаНаборку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьОтгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПаллетыОтгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьБутылкиНаборка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьБутылкиПМУНаборка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьБутылкиПроверка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьНаборки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьНаборкиРозница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПаллетыПриемки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаАкта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЗаНаборкуРозница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПроверкиРозница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПроверки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЗаПосещениеЯчейкиНаборка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПаллетыПриемкиПМУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПриемки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаНаценокПоКА</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗадачи</name>
      <type>
        <types>EnumRef.итWMSТипыЗадачТСД</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЗаЗадачу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Report>

newwms_gift/src/Reports/ит_WMS_МотивационныйОтчет/Forms/ФормаОтчетаУпр/Module.bsl
&НаКлиенте
Процедура ВвестиПароль(Команда)
	ОткрытьФорму("Отчет.ит_WMS_МотивационныйОтчет.Форма.ФормаВводаПароляУПР",,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Пароль=ВыбранноеЗначение;
	ВидимостьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидимостьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьДоступностьЭлементов()
	Если Пароль="4317" Тогда 
		Элементы.ГруппировкаНастроек1.ТолькоПросмотр=Ложь;
		Элементы.ГруппаНастроек2.ТолькоПросмотр=Ложь;
		Элементы.ТаблицаНаценокКА.ТолькоПросмотр=Ложь;
	иначе
		Элементы.ГруппировкаНастроек1.ТолькоПросмотр=Истина;
		Элементы.ГруппаНастроек2.ТолькоПросмотр=Истина;
		Элементы.ТаблицаНаценокКА.ТолькоПросмотр=Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	СтруктураДанных=новый Структура;
	СтруктураДанных.Вставить("ДатаНачала",Отчет.ДатаНачала);
	СтруктураДанных.Вставить("ДатаОкончания",Отчет.ДатаОкончания);
	СтруктураДанных.Вставить("СтоимостьПеремещенияПМУ",Отчет.СтоимостьПеремещенияПМУ);
	СтруктураДанных.Вставить("СтоимостьПеремещения",Отчет.СтоимостьПеремещения);
	//СтруктураДанных.Вставить("СтоимостьЯчейки",Отчет.СтоимостьЯчейки);
	СтруктураДанных.Вставить("СтоимостьПодъема",Отчет.СтоимостьПодъема);
	СтруктураДанных.Вставить("СтоимостьСпуска",Отчет.СтоимостьСпуска);
	СтруктураДанных.Вставить("СтоимостьКоробаПМУ",Отчет.СтоимостьКоробаПМУ);
	СтруктураДанных.Вставить("СтоимостьКороба",Отчет.СтоимостьКороба);
	СтруктураДанных.Вставить("АгрегацияПаллеты",Отчет.АгрегацияПаллеты);
	СтруктураДанных.Вставить("ФизическаяПроверка",Отчет.ФизическаяПроверка);
	СтруктураДанных.Вставить("АгрегацияКоробов",Отчет.АгрегацияКоробов);
	СтруктураДанных.Вставить("Опалечивание",Отчет.Опалечивание);
	СтруктураДанных.Вставить("ТаблицаНаценокПоКАВыгрузка",Отчет.ТаблицаНаценокПоКА.Выгрузить());
	СтруктураДанных.Вставить("СтоимостьЗаНаборку",Отчет.СтоимостьЗаНаборку);
	СтруктураДанных.Вставить("СтоимостьПаллетыНаборки",Отчет.СтоимостьПаллетыНаборки);
	СтруктураДанных.Вставить("СтоимостьОтгрузки",Отчет.СтоимостьОтгрузки);
	СтруктураДанных.Вставить("СтоимостьПаллетыОтгрузки",Отчет.СтоимостьПаллетыОтгрузки);
	СтруктураДанных.Вставить("СтоимостьБутылкиНаборка",Отчет.СтоимостьБутылкиНаборка);
    СтруктураДанных.Вставить("СтоимостьБутылкиПМУНаборка",Отчет.СтоимостьБутылкиПМУНаборка);
    СтруктураДанных.Вставить("СтоимостьБутылкиПроверка",Отчет.СтоимостьБутылкиПроверка);
	СтруктураДанных.Вставить("СтоимостьНаборки",Отчет.СтоимостьНаборки);
	СтруктураДанных.Вставить("СтоимостьНаборкиРозница",Отчет.СтоимостьНаборкиРозница);
	СтруктураДанных.Вставить("СуммаПаллетыПриемки",Отчет.СуммаПаллетыПриемки);
	СтруктураДанных.Вставить("СуммаАкта",Отчет.СуммаАкта);
	СтруктураДанных.Вставить("СтоимостьЗаПосещениеЯчейкиНаборка",Отчет.СтоимостьЗаПосещениеЯчейкиНаборка);
    СтруктураДанных.Вставить("СтоимостьПроверки",Отчет.СтоимостьПроверки);
	СтруктураДанных.Вставить("СтоимостьПроверкиРозница",Отчет.СтоимостьПроверкиРозница);
	СтруктураДанных.Вставить("СтоимостьЗаНаборкуРозница",Отчет.СтоимостьЗаНаборкуРозница);
	СтруктураДанных.Вставить("СуммаПаллетыПриемкиПМУ",Отчет.СуммаПаллетыПриемкиПМУ);
	СтруктураДанных.Вставить("СтоимостьПриемки",Отчет.СтоимостьПриемки);

	//СохранитьЗначение("итWMSМотивационныйОтчет",СтруктураДанных);
	итWMSПривилегированныйМодуль.СохрнаитьНастройкиВХранилищеОбщихНастроек("итWMSМотивационныйОтчет","итWMSМотивационныйОтчет",СтруктураДанных,"итWMSМотивационныйОтчет");

КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Значение=итWMSПривилегированныйМодуль.ЗагрузитьНастройкиИзХранилищаОбщихНастроек("итWMSМотивационныйОтчет","итWMSМотивационныйОтчет","итWMSМотивационныйОтчет");
Если ТипЗнч(Значение)=Тип("Структура") Тогда 
	ЗаполнитьЗначенияСвойств(Отчет,Значение);
	Если Значение.Свойство("ТаблицаНаценокПоКАВыгрузка") Тогда 
		Отчет.ТаблицаНаценокПоКА.Загрузить(Значение.ТаблицаНаценокПоКАВыгрузка);
	КонецЕсли;	
КонецЕсли;	

КонецПроцедуры
